[
    {
        "id": 101882,
        "metadata": {
            "Meta Keywords": " Chkrootkit, system security, rootkit detection, LKM trojan detection, CGI backdoor detection, system integrity, compilation, package, GNU Flex, GNU Bison, GNU Make, ANSI C-Compiler, Mhash library, errors, recognition, Aide package, libmhash, ldconfig, config.log, AIDE, sources, tar xzf aide-0.10.tar.gz, configure, make, su root, make install, configuration file, aide.conf, permissions, inode, number of links, user, group, size, block count, mtime, atime, ctime, md5 checksum, sha1 checksum, rmd160 checksum, tiger checksum, growing size, empty group",
            "Meta Description": " \n- Chkrootkit is a powerful tool for checking the integrity of your system and detecting rootkits, LKM trojans, and CGI backdoors. Download the latest version from the official website and follow the instructions to compile and run the program. Chkrootkit also offers additional functions for checking the integrity of specific binaries or directories. Learn more about its capabilities and how it can help improve your system's security.\n- Learn how to compile a package by ensuring all the necessary dependencies are available, downloading them if needed. Find solutions for common errors related to the Mhash library. Follow step-by-step instructions to configure the AIDE package and its aide.conf configuration file. Understand the different functions and rules available in AIDE for controlling and monitoring your system."
        }
    },
    {
        "id": 101883,
        "metadata": {
            "Meta Keywords": " internet security, cybercrime, network security, intrusion detection, virus scanners",
            "Meta Description": "\n\"The closing weeks of last month marked the tenth anniversary of the inception commercial Internet security. Internet Security Systems celebrated a decade in business and as an industry we celebrate a decade of securing cyberspace for all users. In the last 10 years the Internet security industry, as well as the Internet as a whole, has grown dramatically developing into an essential part of mainstream culture. With corporate networks being vital to the every day operational success of millions of world wide businesses, network and Internet security has never been more necessary. Internet security is a marathon; a race against time. As an industry we have to outsmart hackers and cyber vandals before they outsmart us.\""
        }
    },
    {
        "id": 101884,
        "metadata": {
            "Meta Keywords": " ./configure, Osiris, static binary, compile, make agent, make console, tarball, management console, remote_update.pl, untar, copy files, directory, script, deploy, hosts, ccrypt",
            "Meta Description": " Learn how to compile and deploy Osiris, a file-integrity program, by following these step-by-step instructions. This guide covers topics such as using static binaries, creating tarballs, copying files, creating scripts, and specifying hosts. Additionally, it mentions the installation of ccrypt based on your specific operating system and format preferences."
        }
    },
    {
        "id": 101897,
        "metadata": {
            "Meta Keywords": " Red Hat, Inc., Security Advisory, initscripts, /tmp race, lang.csh, resolv.conf, CHAP, ppp-watch, bug fixes, PPP default route, PPP log filling, device aliases, typo in rc.sysinit, sound mixer settings, erroneous settings of default routes, Red Hat Linux 6.1, Intel, Sparc, RPMs",
            "Meta Description": " This Red Hat, Inc. Security Advisory announces the availability of new initscripts packages that fix several bugs, including a security vulnerability in lang.csh that could allow arbitrary shell code execution. Other fixes include resolving issues with CHAP authentication, DNS entries, Linuxconf configurations, and various functionality bugs. This page provides information about various issues related to PPP default route, PPP log filling, device aliases, typo in rc.sysinit, sound mixer settings, and erroneous settings of default routes. It also includes relevant releases/architectures (Red Hat Linux 6.1, Intel, Sparc) and the required RPMs. Instructions for solution and verification are provided as well."
        }
    },
    {
        "id": 101898,
        "metadata": {
            "Meta Keywords": " Red Hat, Inc., Security Advisory, syslogd, RHSA-1999:055-01, denial of service attack, sysklogd, stream socket, bugtraq id #809, vulnerability, patches, Red Hat Linux 6.1, Intel, RPMs, sysklogd-1.3.31-14.i386.rpm, sysklogd-1.3.31-14.src.rpm, solution, verification, MD5 sum",
            "Meta Description": "\n\"Red Hat, Inc. Security Advisory: There is a denial of service attack in syslogd. The vulnerability allows the user to open a large number of connections to the log daemon, making the system unresponsive. Patches are available for Red Hat Linux 6.1. Make sure to verify the integrity of the packages before installation.\""
        }
    },
    {
        "id": 101899,
        "metadata": {
            "Meta Keywords": " security advisory, bind, DNS server, Red Hat, vulnerabilities, remote attackers, DNS server, upgrade, bind packages, meta keywords, RPM, GPG, key, verify, command, md5sum, corruption, tampering, GnuPG keys",
            "Meta Description": " This is a security advisory for the package \"bind\", which is the DNS server provided by Red Hat. The advisory explains various vulnerabilities in previous versions of bind, including a bug in the processing of NXT records that could potentially allow remote attackers to gain access to the DNS server. The advisory recommends upgrading to the latest bind packages to address these vulnerabilities. These packages are GPG signed by Red Hat, Inc. for security. You can verify each package using the rpm --checksig command. If you only want to check for corruption or tampering, use the rpm --checksig --nogpg command. Note that you need RPM >= 3.0 to check GnuPG keys."
        }
    },
    {
        "id": 101910,
        "metadata": {
            "Meta Keywords": " Debian Security Advisory, bind vulnerability, Denial of Service attack, server access, bind package upgrade, Debian GNU/Linux 2.1, Intel, Motorola 680x0, alpha, Sun sparc architecture, source archives, Intel ia32 architecture, MD5 checksum, stable, updates, binary-m68k, dnsutils, binary-sparc, ftp, debian.org, apt-get, dpkg-ftp, PGP signature",
            "Meta Description": " This Debian Security Advisory announces a vulnerability in the bind package of Debian GNU/Linux 2.1, which can be exploited for a Denial of Service attack or unauthorized server access. The advisory recommends immediate upgrading of the bind package to version 8.2.5p5-0slink1. It provides source archives and binary packages for different architectures (Intel, Motorola 680x0, alpha, Sun sparc) to facilitate the upgrade process. This page contains MD5 checksum values for various files related to the Motorola 680x0 and Sun Sparc architectures on Debian's stable release. These files are available for download from the security.debian.org website and will soon be moved to ftp.debian.org. The page also provides information on how to access the files using apt-get or dpkg-ftp commands."
        }
    },
    {
        "id": 101911,
        "metadata": {
            "Meta Keywords": " Red Hat, Inc., security advisory, package, Netscape, Netscape 4.7 communicator, navigator, Mozilla, Red Hat Linux, RPM, font directory, GnuPG keys",
            "Meta Description": " Stay up to date with the latest security advisory from Red Hat, Inc. regarding Netscape 4.7 communicator and navigator packages. Learn more about the new release that fixes security issues in Javascript and form signing."
        }
    },
    {
        "id": 101912,
        "metadata": {
            "Meta Keywords": "\n1. Red Hat, Inc. \n2. security advisory \n3. XFree86 \n4. Xterm \n5. Xdm \n6. Xinit \n7. Xfs \n8. Xinitrc ",
            "Meta Description": "\nRed Hat, Inc. has released new XFree86 packages for Red Hat Linux, addressing newly discovered security problems and fixing numerous bugs. These packages include updated drivers and are available for Red Hat Linux 4.2, 5.2, and 6.0 on all architectures."
        }
    },
    {
        "id": 101913,
        "metadata": {
            "Meta Keywords": " Red Hat, Inc., Security Advisory, mars_nwe, buffer overflow, RHSA-1999:037-01",
            "Meta Description": "\n\"Buffer overflows have been found in the mars_nwe package, which can lead to a local root compromise. The issue was noted by Przemyslaw Frasunek and Babcia Padlina Ltd., and a patch is available. To fix the problem, run the appropriate RPM for your architecture using the 'rpm -Uvh filename' command. Verify the integrity of each package using 'rpm --checksig filename' or check the md5sum using 'rpm --checksig --nopgp filename'. For additional security, Red Hat Inc.'s key is available for verification. Relevant bug IDs for this advisory are 5002, and the mars_nwe package is relevant to Red Hat Linux 6.0, all architectures.\""
        }
    },
    {
        "id": 101914,
        "metadata": {
            "Meta Keywords": " Red Hat, Inc., Security Advisory, inews, buffer overflow, inn, rnews, uucp, setuid bit, Red Hat Linux, cleanfeed, BUGTRAQ mailing list, RPM, verification, MD5 sum, PGP signed.",
            "Meta Description": "\nThis Red Hat, Inc. security advisory addresses a buffer overflow problem in the inews program. New packages for INN are available to fix this issue. This advisory provides information on the problem, relevant releases/architectures, RPMs required, and problem description. No active exploits of the problem have been found so far."
        }
    },
    {
        "id": 101916,
        "metadata": {
            "Meta Keywords": " Red Hat, security advisory, vixie-cron, crond, buffer overflow, cron daemon, RHSA-1999:030-02, logrotate scripts",
            "Meta Description": " \n1. This Red Hat security advisory, RHSA-1999:030-02, addresses a buffer overflow vulnerability in the vixie-cron package, specifically in the cron daemon (crond). This vulnerability could allow local users to gain elevated privileges. The advisory provides details on the issue, including the affected versions and architectures, as well as the required RPMs to fix the problem. The description also highlights the potential risks associated with the vulnerability and the need for immediate action to prevent unauthorized access and potential exploits."
        }
    },
    {
        "id": 101917,
        "metadata": {
            "Meta Keywords": " wu-ftpd, buffer overflow, Red Hat Linux, security fix, bug IDs",
            "Meta Description": " \n\"New packages of wu-ftpd are available for all Red Hat Linux platforms. This version includes an important security fix as well as fixes for all known problems in wu-ftpd at this time. An explotable buffer overflow security problem in the wu-ftpd daemon has been fixed. For each RPM for your particular architecture, run: rpm -Uvh filename. Then restart inetd by typing: /etc/rc.d/init.d/inet restart. Verify each package with the following command: rpm --checksig filename. These packages are also PGP signed by Red Hat Inc. for security.\""
        }
    },
    {
        "id": 101918,
        "metadata": {
            "Meta Keywords": " telnet, in.telnetd, denial of service attack, Red Hat Linux, security advisory",
            "Meta Description": " \"This blog discusses the security advisory RHSA-1999:029-01 related to a denial of service attack in in.telnetd. The blog provides information on the bug fixed, relevant releases/architectures, RPMs required, problem description, solution, and verification. Red Hat Inc. has also signed the packages for security. Learn more at Red Hat's website.\""
        }
    },
    {
        "id": 101919,
        "metadata": {
            "Meta Keywords": " libtermcap, buffer overflow, tgetent(), Red Hat Linux 6.0, termcap, xterm",
            "Meta Description": " Red Hat, Inc. Security Advisory: Buffer overflow fixed in libtermcap tgetent() function. This vulnerability could allow local users to gain root privileges. Update your RPMs for Red Hat Linux 6.0 to prevent exploitation."
        }
    },
    {
        "id": 101920,
        "metadata": {
            "Meta keywords": " Red Hat, Inc., Security Advisory, pump, DHCP, RoadRunner, @Home",
            "Meta description": " New version of pump, 0.7.0, fixes several problems, including a potential security hole. We strongly recommend that all users using DHCP upgrade to pump 0.7.0, particularly if you use DHCP on a public network such as a cable modem or ADSL service. This is a correction to our previous announcement, which did not mention the security bug that is fixed in pump 0.7.0. Obsoleted by: None. Conflicts with: None. Relevant releases/architectures: Red Hat Linux 6.0, all architectures. These packages are also PGP signed by Red Hat Inc. for security. Our key is available at: [link]. You can verify each package with the following command: rpm --checksig filename. If you only wish to verify that each package has not been corrupted or tampered with, examine only the md5sum with the following command: rpm --checksig --nopgp filename."
        }
    },
    {
        "id": 101922,
        "metadata": {
            "Meta Keywords": "Red Hat, Inc., Security Advisory, Samba, smbd, nmbd, race condition, security holes",
            "Meta Description": "This Red Hat, Inc. security advisory provides new Samba packages for Red Hat Linux 4.2, 5.2, and 6.0. The advisory, identified as RHSA-1999:022-02, addresses several security issues in previous Samba releases. The advisory highlights the fixes made in Samba 2.0.5a, bug IDs that were fixed, relevant releases/architectures, and RPMs required for installation. Additionally, the document discusses a race condition in smbmnt that can lead to problems if it is installed setuid root. It provides a solution by instructing users to install updated RPMs and restart affected services. It also provides verification instructions for ensuring package integrity and lists the PGP signed packages available for download from Red Hat Inc."
        }
    },
    {
        "id": 101923,
        "metadata": {
            "Meta Keywords": "gnumeric, security problem, spreadsheet package, potential security issues, Red Hat Linux\nMeta Description: The gnumeric spreadsheet package has fixed a potential security problem. Upgrade to the latest version provided to address the issue. Verify the packages using RPM and check the MD5 sum for security assurance."
        }
    },
    {
        "id": 101924,
        "metadata": {
            "Meta keywords": "Red Hat, Inc., net-tools, security problem, RHSA-1999:017-01, buffer overruns",
            "Meta description": "\"Potential security problem in Red Hat 6.0 net-tools. Several potential buffer overruns have been corrected within the net-tool package. Relevant releases/architectures: Red Hat Linux 6.0, all architectures. RPMs required: Intel, Alpha, SPARC. These packages are also PGP signed by Red Hat Inc. for security.\"",
            "(Note": "The meta description has been formatted with new lines using \"\\\" for readability purposes. In actual implementation, the new lines should be marked by HTML character entities \"&#13;&#10;\" instead of \"\\\".)"
        }
    },
    {
        "id": 101925,
        "metadata": {
            "Meta Keywords": "Red Hat Inc., Security Advisory, Package, KDE, update, Red Hat Linux 6.0, security holes, bugs, RPMs, Intel, Alpha, SPARC",
            "Meta Description": "Upgrade your Red Hat Linux 6.0 system with the new KDE RPMs available. This update includes fixes for security holes and bugs found in the original RPMs. Download the necessary RPMs for your architecture (Intel, Alpha, SPARC) from the provided FTP links.",
            "Explanation": "1. Meta Keywords: Red Hat Inc., Security Advisory, Package, KDE, update, Red Hat Linux 6.0, security holes, bugs, RPMs, Intel, Alpha, SPARC\n   - These keywords are relevant to the blog text and focus on Red Hat Inc., the security advisory, package updates, KDE (the specific software), and the supported architectures (Intel, Alpha, SPARC).",
            "2. Meta Description": "Upgrade your Red Hat Linux 6.0 system with the new KDE RPMs available. This update includes fixes for security holes and bugs found in the original RPMs. Download the necessary RPMs for your architecture (Intel, Alpha, SPARC) from the provided FTP links.\n   - This meta description is within the 160 characters limit and provides a concise summary of the blog text content. It mentions upgrading Red Hat Linux 6.0 with new KDE RPMs to fix security and bug issues, and provides instructions to download the necessary RPMs for the supported architectures."
        }
    },
    {
        "id": 101926,
        "metadata": {
            "Meta Keywords": "Red Hat, Inc., Security Advisory, dev, rxvt, screen, Red Hat Linux 6.0",
            "Meta Description": "This security advisory from Red Hat, Inc. addresses a vulnerability in the dev, rxvt, and screen packages for Red Hat Linux 6.0. The advisory provides information on the issue, relevant releases and architectures, and the required RPMs for the upgrade. The problem description outlines the vulnerability related to the /dev/pts filesystem and the potential insecure modes for tty devices. The solution includes instructions to upgrade to the latest errata releases for the affected packages and manually unmount and remount the /dev/pts filesystem."
        }
    },
    {
        "id": 101930,
        "metadata": {
            "Meta keywords": "Netscape, mozilla, Red Hat Linux, 75dpi font, RPM, GnuPG, verification, security",
            "Meta description": "This page provides information about an error in the original packages released for Red Hat Linux 6.0 and 6.1. It includes instructions for fixing the error, verifying package integrity, and obtaining the necessary RPMs. The page also mentions GnuPG keys and provides a link to Red Hat Inc.'s contact page for further assistance."
        }
    },
    {
        "id": 101931,
        "metadata": {
            "Meta Keywords": "Red Hat Inc., Security Advisory, PAM, PAM packages, RHSA-1999:040-1, login, NIS server",
            "Meta Description": "Under certain network configurations, the PAM packages shipped with Red Hat Linux 6.1 may allow access to locked NIS accounts. Upgrade PAM packages to mitigate the risk. Red Hat recommends following the solution provided in this advisory."
        }
    },
    {
        "id": 101932,
        "metadata": {
            "Meta Keywords": "Red Hat, Inc., Security Advisory, Package Screen, screen, Unix98 ptys, permissions",
            "Meta Description": "The version of screen that shipped with Red Hat Linux 6.1 defaulted to not using Unix98 ptys, leaving the ptys with insecure permissions. The updated packages restore the Unix98 pty support. For more information and to verify the packages, visit http://www.RedHat.com/corp/contact.html."
        }
    },
    {
        "id": 101933,
        "metadata": {
            "Meta keywords": "Red Hat, Inc., security, advisory, wu-ftpd, RHSA-1999:043-01, wu-ftp, exploit, vulnerabilities, buffer overflow, arbitrary code execution, memory consumption, Red Hat Linux",
            "Meta description": "\"Red Hat, Inc. Security Advisory for wu-ftpd - This advisory addresses security problems in WU-FTPD, the FTP server shipped with all versions of Red Hat Linux. Three vulnerabilities have been identified, including buffer overflow and memory consumption, which can be exploited by remote and local intruders to execute arbitrary code and disrupt system operation. Relevant updates and RPMs are provided for each architecture. Verify the integrity of packages using the provided MD5 sums. Red Hat Inc. signature ensures security. For more information, visit our website.\""
        }
    },
    {
        "id": 101934,
        "metadata": {
            "Meta keywords": "Red Hat, security advisory, lpr, file access problems, lpd",
            "Meta description": "This security advisory from Red Hat, Inc. discusses file access problems in the lpr and lpd programs, with potential vulnerabilities that could allow unauthorized users to print files they do not have access to. The advisory provides details on the issue, its history, and related bug IDs. It also mentions the relevant releases and architectures affected, as well as the RPMs required for Intel platforms."
        }
    }
]